docs/2020-10-06-1014 Exporting with Org-publish.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-10-06 Tue 11:54 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Exporting with org-publish</title>
<meta name="generator" content="Org mode">
<link rel='stylesheet' href='static/style.css' type='text/css'/>
</head>
<body>
<div id="preamble" class="status">
<div id='head'>
    <h1><b>zd-tutorial</b></h1>
    &mdash;
    <ul>
        <li><a href='./2020-02-15-1247 Welcome.html'>Welcome</a></li>
        <li><a href='https://efls.github.io/zetteldeft'
	       style='float: right'>Zetteldeft</a></li>
    </ul>
</div>
</div>
<div id="content">
<header>
<h1 class="title">Exporting with org-publish</h1>
</header><p>
Backlink: <a href="./2020-02-15-1247 Welcome.html">ยง2020-02-15-1247</a> Welcome
</p>

<p>
Exporting notes is one way to conveniently read them outside of Emacs.
</p>

<p>
Zetteldeft provides functions to conveniently export notes.
Exporting relies on Org-mode and the <code>org-publish</code> functions and revolves around <code>zetteldeft-export--prepare-tmp-notes</code>.
</p>

<p>
This function copies notes to temporary directory <code>zetteldeft-export-tmp-dir</code> and replaces Zetteldeft links with file links in the process.
Org-publish then export these temporary notes to, for example, HTML.
</p>

<p>
<b>Note</b>: The current workflow only works with Org notes.
Expanding this into Markdown should be easily achieved by modifying the preparation function.
Get in touch if you&rsquo;d like to attempt to do so.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'org-publish-project-alist
  `(<span style="color: #4F894C;">"zd-tutorial"</span>
    <span style="color: #29838D;">:preparation-function</span> zetteldeft-export--prepare-tmp-notes
    <span style="color: #29838D;">:base-directory</span> ,zetteldeft-export-tmp-dir
    <span style="color: #29838D;">:publishing-directory</span> ,(expand-file-name <span style="color: #4F894C;">"docs"</span> default-directory)
   <span style="color: #8b94a5;">; </span><span style="color: #8b94a5;">publishing configuration</span>
    <span style="color: #29838D;">:base-extension</span> <span style="color: #4F894C;">"org"</span>
    <span style="color: #29838D;">:publishing-function</span> org-html-publish-to-html
   <span style="color: #8b94a5;">; </span><span style="color: #8b94a5;">org config</span>
    <span style="color: #29838D;">:headline-levels</span> 4
    <span style="color: #29838D;">:with-tags</span> nil
    <span style="color: #29838D;">:with-toc</span> nil
    <span style="color: #29838D;">:with-date</span> nil
    <span style="color: #29838D;">:with-author</span> nil
   <span style="color: #8b94a5;">; </span><span style="color: #8b94a5;">html config</span>
    <span style="color: #29838D;">:html-head-extra</span> <span style="color: #4F894C;">"&lt;link rel='stylesheet' href='static/style.css' type='text/css'/&gt;\n"</span>
    <span style="color: #29838D;">:html-preamble</span> ,(<span style="color: #3B6EA8;">with-temp-buffer</span>
                      (insert-file-contents 
                        (expand-file-name <span style="color: #4F894C;">"docs/static/html-preamble.html"</span>
                                          default-directory))
                      (buffer-string))
    <span style="color: #29838D;">:html-postamble</span> nil))
</pre>
</div>

<p>
Some pointers for people unfamiliar with Org-publish:
</p>
<ul class="org-ul">
<li><code>:publishing-directory</code> should be where you want your final notes to go</li>
<li><code>:html-head-extra</code> can be used to include styling</li>
<li><code>:html-preamble</code> is used here to include a header, but can safely be removed</li>
</ul>

<p>
The Org exporting features will try to resolve all Org style links and halt if deems one is broken.
To still be able to export, it is a good idea to set <code>org-export-with-broken-links</code> to <code>t</code>.
</p>
</div>
</body>
</html>
